Пансион83/src/Catalogs/Работы/Работы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Работы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SortCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PBXStartCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PBXEndCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IsCheckOutCleaning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRegularCleaning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsVacantRoomCleaning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRepairEndCleaning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsPerGuest</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationRegistrationIsUsed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Пансион83/src/InformationRegisters/НормативыРабот/НормативыРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормативыРабот</name>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>RoomSpace</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Operation</name>
    <type>
      <types>CatalogRef.Работы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RoomType</name>
    <type>
      <types>CatalogRef.ТипыНомеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Room</name>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/Catalogs/Работы/ObjectModule.bsl
//-----------------------------------------------------------------------------
// Get operation standards for the specified hotel, ГруппаНомеров and ГруппаНомеров type
//-----------------------------------------------------------------------------
Function pmGetOperationStandards(Val pHotel, pRoomType, pRoom) Экспорт
	// Initialize resulting value table
	vStds = New ValueTable();
	
	// Fill parameter default values 
	If НЕ ЗначениеЗаполнено(pHotel) Тогда
		pHotel = ПараметрыСеанса.ТекущаяГостиница;
	EndIf;
	
	// Build and run query to get data for the ГруппаНомеров
	If ЗначениеЗаполнено(pRoom) Тогда
		vQry = New Query;
		vQry.Text = 
		"SELECT
		|	НормативыРабот.Operation,
		|	SUM(НормативыРабот.Продолжительность) AS Продолжительность,
		|	SUM(НормативыРабот.RoomSpace) AS RoomSpace
		|FROM
		|	InformationRegister.НормативыРабот AS НормативыРабот
		|WHERE
		|	НормативыРабот.Operation = &qOperation
		|	AND НормативыРабот.Гостиница = &qHotel
		|	AND НормативыРабот.НомерРазмещения = &qRoom
		|GROUP BY
		|	НормативыРабот.Operation";
		vQry.SetParameter("qOperation", Ref);
		vQry.SetParameter("qHotel", pHotel);
		vQry.SetParameter("qRoom", pRoom);
		vStds = vQry.Execute().Unload();
	EndIf;
	
	// Run query to get data for the ГруппаНомеров type
	If vStds.Count() = 0 And ЗначениеЗаполнено(pRoomType) Тогда
		vQry = New Query;
		vQry.Text = 
		"SELECT
		|	НормативыРабот.Operation,
		|	SUM(НормативыРабот.Продолжительность) AS Продолжительность,
		|	SUM(НормативыРабот.RoomSpace) AS RoomSpace
		|FROM
		|	InformationRegister.НормативыРабот AS НормативыРабот
		|WHERE
		|	НормативыРабот.Operation = &qOperation
		|	AND НормативыРабот.Гостиница = &qHotel
		|	AND НормативыРабот.ТипНомера = &qRoomType
		|GROUP BY
		|	НормативыРабот.Operation";
		vQry.SetParameter("qOperation", Ref);
		vQry.SetParameter("qHotel", pHotel);
		vQry.SetParameter("qRoomType", pRoomType);
		vStds = vQry.Execute().Unload();
	EndIf;
	
	// Run query to get data for the empty ГруппаНомеров and ГруппаНомеров type
	If vStds.Count() = 0 Тогда
		vQry = New Query;
		vQry.Text = 
		"SELECT
		|	НормативыРабот.Operation,
		|	SUM(НормативыРабот.Продолжительность) AS Продолжительность,
		|	SUM(НормативыРабот.RoomSpace) AS RoomSpace
		|FROM
		|	InformationRegister.НормативыРабот AS НормативыРабот
		|WHERE
		|	НормативыРабот.Operation = &qOperation
		|	AND НормативыРабот.Гостиница = &qHotel
		|	AND НормативыРабот.ТипНомера = &qRoomType
		|GROUP BY
		|	НормативыРабот.Operation";
		vQry.SetParameter("qOperation", Ref);
		vQry.SetParameter("qHotel", pHotel);
		vQry.SetParameter("qRoomType", Справочники.ТипыНомеров.EmptyRef());
		vQry.SetParameter("qRoom", Справочники.НомернойФонд.EmptyRef());
		vStds = vQry.Execute().Unload();
	EndIf;
	
	// Run query to get data for the empty hotel, ГруппаНомеров and ГруппаНомеров type
	If vStds.Count() = 0 Тогда
		vQry = New Query;
		vQry.Text = 
		"SELECT
		|	НормативыРабот.Operation,
		|	SUM(НормативыРабот.Продолжительность) AS Продолжительность,
		|	SUM(НормативыРабот.RoomSpace) AS RoomSpace
		|FROM
		|	InformationRegister.НормативыРабот AS НормативыРабот
		|WHERE
		|	НормативыРабот.Operation = &qOperation
		|	AND НормативыРабот.Гостиница = &qHotel
		|	AND НормативыРабот.ТипНомера = &qRoomType
		|GROUP BY
		|	НормативыРабот.Operation";
		vQry.SetParameter("qOperation", Ref);
		vQry.SetParameter("qHotel", Справочники.Гостиницы.EmptyRef());
		vQry.SetParameter("qRoomType", Справочники.ТипыНомеров.EmptyRef());
		vQry.SetParameter("qRoom", Справочники.НомернойФонд.EmptyRef());
		vStds = vQry.Execute().Unload();
	EndIf;
	
	Return vStds;
EndFunction //pmGetOperationStandards
